In [ ]:
# This line install the package. Only need to run once.
# It requires internet to install the package
!pip install -U fuzzywuzzy

In [1]:
import pandas as pd
from fuzzywuzzy import process

# 1.0 Creating Sample Data for Matching

In [2]:
data = [
    ['Merry Chan', 'Female'],
    ['Tan Ah Beng', 'Male'],
    ['Abdul Aziz', 'Male'],
    ['Kumar Rajah', 'Male']
]


df1 = pd.DataFrame(data, columns=['name', 'gender'])
df1

          name  gender
0   Merry Chan  Female
1  Tan Ah Beng    Male
2   Abdul Aziz    Male
3  Kumar Rajah    Male

In [3]:
data2 = [
    ['Marry Chan', 70],
    ['Tang Ah Ben', 35],
    ['Abu Aziz', 75]
]


df2 = pd.DataFrame(data2, columns=['name', 'score'])
df2

          name  score
0   Marry Chan     70
1  Tang Ah Ben     35
2     Abu Aziz     75

# 2.0 Generating the Matched Text

In [4]:
# list for storing the matching result
results = []

# for each step in the loop, we process every "name" value in the df1
for name_in_df1 in df1.name:
    # Store the two results returned by the function
    (best_matched, match_score, _) = process.extractOne(name_in_df1, df2.name)
    # Append the results into the list, together with the original value (i.e. name_in_df1)
    results.append([name_in_df1, best_matched, match_score])

In [5]:
# Transform the results into a DataFrame
# This make it easier to view and easy to be used for further processing or merging
results = pd.DataFrame(results, columns=['name_in_table1', 'best_match_from_table2', 'match_score'])
results

  name_in_table1 best_match_from_table2  match_score
0     Merry Chan             Marry Chan           90
1    Tan Ah Beng            Tang Ah Ben           91
2     Abdul Aziz               Abu Aziz           89
3    Kumar Rajah             Marry Chan           48

> **What's after this?**
>
> You can use this as the "mapping table" to merge the records from the two DataFrame.
>
> ⚠️ Do Note that you might still need manual check on the matched text, or do further processing for cleaner results.

# 3.0 Reference and Read More

For more details like other ways to use the package and the detailed documentation, do visit:
[https://github.com/seatgeek/thefuzz](https://github.com/seatgeek/thefuzz)